{"0": ["Welcome to the History of Linux", "Linux turned 30 in 2021. The first Linux kernel was made public on September 17, 1991. So what exactly is \nLinux? Linux is a community of open-source operating systems that are developed on top of the Linux kernel. \nLinux comes packaged within Linux distributions.\nWhat about Linux distributions? Linux distributions, \nor fondly called distro, are nothing but software collections based on the Linux kernel and a package \nmanagement system. Users get to use Linux generally by downloading and installing a distro into their \nmachines. We’ll have a more detailed discussion about Linux distributions in the later part of this write-up.\n\nLinux was written by Finnish-American Software Engineer Linus Benedict Torvalds. Are you interested to know \nthe history of Linux? How was it created? What’s the story behind the development and naming? How did Linux \ncome under the GNU GPL license? What’s Linux mascot? What are the latest developments? What’s there between \nMicrosoft and Linux?… Then this article is just for you. Let’s start!"], "1": ["What Inspired Creating Linux", "AT&T was dropped from Multics. This led to the invention and \nimplementation of the Unix OS in 1969. Unix was created by American Computer Science legends Kenneth Lane \nThompson and Dennis MacAlistair Ritchie of AT&T Bell Labs. And the first version was released in 1970.\n2 years \nlater they created C out of UNIX. And there comes the future base of many programming languages! C added \nportability and availability to UNIX and thus it became increasingly popular, widely adopted, modified, \nand copied by businesses and academic institutions across the globe. AT&T was the sole owner of the UNIX \ncopyrights.\nAmerican Programmer Richard Matthew Stallman began the GNU project to create a free UNIX-like \noperating system in 1983. He wrote GPL (GNU General Public License) as a part of his project. By the 1990s, \nthere was enough software to build a complete operating system. However, Hurd, the GNU kernel couldn’t pull \nenough development work leaving GNU incomplete.\nIn 1987, American-Dutch Professor Andrew S. Tanenbaum wrote \nUNIX-like system MINIX for academic use. The source code of MINIX was made available for everyone, however, \nMINIX couldn’t be either modified or redistributed. MINIX’s 16-bit architecture wasn’t well adapted to Intel’s \nincreasingly popular 386 design for PCs. It became highly expensive for private users to use UNIX for Intel 386 \npersonal computers.\nAnd this led to Linus Torvalds’ beginning of a new project. Later Linus Torvalds stated that \nif either 386BSD or GNU Hurd was available during his time, he wouldn’t be interested in writing his project."], "2": ["The Story Behind the Name Linux", "Linus Torvalds had Freax in mind as the name of Linux. Torvalds created \nFreax as an amalgamation of three words – Free, Freak, and X from UNIX. For about half a year, Linus Torvalds \nused Freax as his file storage. Initially, Linux was considered but dismissed as it might sound “egotistical”.\nIn \nSeptember 1991, FUNET’s FTP server was used to upload files for the purpose of development. However, Ari Lemmke \nat HUT  (Helsinki University of Technology), one of the FTP’s volunteer administrators, wasn’t quite fond of the \nname Freax. So, he altered the name as Linux on the FTP server. Later Torvalds consented to the same.\nTorvalds \nadded an audio guide to the Linux kernel source code to correctly pronounce the word Linux. Although the kernel \nwas often used with other software of the GNU Project, the designation “Linux” was primarily used only for the \nkernel. It’s in fact, kernel very quickly became GNU software’s most popular adoption.\nIn June 1994, \nLinux was called a “free UNIX clone” in GNU’s bulletin. Also, the Debian Project named its product Debian \nGNU/Linux. In May 1996, Stallman published Emacs 19.31 editor. In the same, Linux became Lignux combining GNU and \nLinux. But soon GNU/Linux was favored over Lignux.\nThe name GNU/Linux garnered mixed reactions from the Linux \ncommunity and users. Debian and the GNU projects preferred to use this name. But people generally liked to use \nLinux."], "3": ["Torvalds’ Linux Development", "On August 25, 1991, Linus Torvalds began his project while studying at the \nUniversity of Helsinki. This very project turned out to be the Linux kernel. It was based on MINIX. Also, \nGNU C Compiler was used in the development.\nTorvalds’ new program was for the hardware used by him and \nindependent of any OS. Linus aimed to use the functions of his PC having an 80386 microprocessor. Years later in \n2001, Torvalds penned down his autobiography Just for Fun: The Story of an Accidental Revolutionary. In the book, \nhe mentioned he started his project as “just a hobby” and ended up with an OS kernel. Then he was only 21 and \nannounced the new project via a Usenet Newsgroup comp.os.minix.\nSo, what’s a Usenet Newsgroup? A Usenet Newsgroup \nis nothing but a Usenet repository used for updates posted by its users. They are basically discussion groups. \nand not particularly used for publishing news. Newsgroups are not technically but functionally the same as \ndiscussion forums. Newsreader clients are used for reading newsgroup content.\nAs per Linus Torvalds, \nLinux started gaining importance after porting X Window System to Linux created by Orest Zborowski. If you want \nto learn more about Orest Zborowski this interview might interest you. X Window System or X11 is common on \nUNIX-based operating systems. It’s windowing for bitmap displays."], "4": ["Role of GNU GPL in Linux", "The first Linux kernel was published under its very own license. This had some \nrestrictions on commercial activities. However, the first Linux kernel 0.01 was released with a GNU Bash shell’s \nbinary. The software included was developed under the GNU GPL or GNU General Public License. It was a part of the \ninfamous GNU project.\nLinus Torvalds wrote the “Notes for linux release 0.01”. In this note, he mentioned the GNU \nsoftware required to run Linux. Also, he revealed that most of the tools come under the GNU copyleft. Now, \nwhat’s copyleft? Copyleft is the practice where you are authorized to modify and freely distribute intellectual \nproperty. And you’ll be required to preserve the rights in derivatives created out of that same property.\n\nCopyleft licenses are able to maintain copyright conditions of documents, computer software, art, \netc. The information required for Copyleft is generally in source code file formats.\nTorvalds wanted to release \nthe Linux kernel under the GNU GPL License in 1992. And he made this announcement in the release notes version \n0.12. In mid-December of the same year, Torvalds published version 0.99 with the GNU GPL license. Linux and GNU \ndevelopers’ joint efforts integrated Linux with GNU components to create a fully functional free OS. Linus once \nmade a statement by saying – “making Linux GPLed was definitely the best thing I ever did.”\nAround 2000, \nLinus Torvalds announced Linux kernel comes under the GPLv2 license. After years of drafts and discussions, \nin 2007, Torvalds released GPLv3. But the majority of Linux developers including Torvalds wasn’t ready to adopt \nthe new license."], "5": ["Linux Mascot", "In 1996, Linus Torvalds made the announcement of a Linux Mascot. When the Linux team was \ninto the mascot selection, Torvalds mentioned a personal story. It was about a little penguin that had bitten him \nwhen he visited the National Zoo & Aquarium of Canberra, Australia. Then the team considered a penguin to be the \nofficial Linux mascot.\nAmerican Programmer Larry Ewing presented the draft of today’s Linux mascot based on \nLinus’ experience with the little penguin. James Hughes suggested Tux as the name of the mascot. Tux came from \nTorvalds’ UNIX, along with being the contraction of the Tuxedo having a similar color to that of the penguin."], "6": ["Linux Distributions", "While talking about Linux, Linux distributions can no way be skipped, because Linux \ndistributions complete Linux as an operating system and a community altogether.\nIn 1991, after developing the \nkernel, Linus Torvalds distributed the first version, 0.01 as only a source code. Later a downloadable floppy \ndisk image pair was also distributed. This pair contained one bootable disk image including the Linux kernel and \nanother disk image having a set of GNU utilities, tools to set up a file system.\nHowever, the installation \nprocedure wasn’t that easy. Linux distributions worked like wonders to ease up installations, and especially in \nthe face of increasing software availabilities. H. J. Lu’s “Boot-root”, a downloadable disk image pair including \nLinux kernel and the minimal tools, can be called the first Linux distribution available released in 1991. Other \nearly distros include MCC Interim Linux, Softlanding Linux System or SLS, and Yggdrasil Linux/GNU/X, all in 1992.\nSLS \nwasn’t maintained well. So, a new distribution, Slackware based on SLS, was released in July 1993. Patrick \nVolkerding is the developer and maintainer of the same. Also, Ian Murdock created Debian as a free Linux \ndistribution and released it in December 1993. So, Slackware and Debian are the two oldest and still running \nLinux distributions.\nLinux distributions garnered positive responses from the users as the  DOS and Windows \nalternatives in IBM PC compatible machines, Mac OS in the Apple Macintosh, and UNIX’s proprietary versions. \nPeople used to use UNIX in their schools and/or workplaces. Linux distributions were appreciated for being \nlow-cost or completely free, and for providing source code."], "7": ["10 Facts about Linux", "1. The software is free. You don’t have to shed a dime for this operating system.\n\n2. At the beginning of the project, the first Linux kernel occupied only 65 KB. Today, even a regular Linux \nkernel contains over 10 million lines of source code.\n3. Nearly 12,000 developers from more than 1,200 companies \nhave contributed to the Linux kernel since tracking began 10 years ago.\n4. Linux runs on just about any hardware \nfrom mobile phones to supercomputers. The open source nature of the kernel and software means it can be ported to \nanother architecture by a third party, while the end user doesn’t need to care about the underlying hardware.\n5. \nOut of top 500 fastest supercomputers of the world, Linux or its variants power 485 of those badass machines. No \nwonder Linux is considered the king of supercomputing.\n6. The Linux OS has been around since the early nineties \nand has managed to stay fairly secure in the realm of widespread viruses, spyware and adware. By making the \nsource available to anyone, security experts can proactively identify any main security flaws in the operating \nsystem before they become public.\n7. The rate of Linux development remains unmatched – Linux kernel 3.15 had the \nbusiest development cycle in the kernel’s history. On average, 7.71 kernel code changes are submitted per hour – \nthat translates to 185 changes every day and nearly 1,300 per week.\n8. Linux users don’t usually have “root” \nprivileges, but lower-level accounts. This means that even if a Linux system is compromised, the virus doesn’t \nhave root access to do system wide damage; more likely, only the user’s local files and programs would be \naffected.\n9. Linux powers the New York Stock Exchange, the Department of Defense of the US, the US. Navy \nSubmarine Fleet, Japan’s bullet trains, traffic control of San Francisco, CERN, many air traffic control systems \nor control of nuclear reactors of submarines and ships – plus, Google, Cisco, Facebook, Twitter, Linked in, \nToyota, etc.\n10. According to openhub.net, the majority (95%) of Linux is written in C language. The second \npopular language for Linux is assembly language (2.8%)."], "8": ["List of Linux Distributions", "1. Debian\n\n2. Gentoo\n\n3. Ubuntu\n\n4. Linux Mint\n\n5. Red Hat Enterprise Linux\n\n6. CentOS\n\n7. Fedora\n\n8. Kali Linux\n\n9. Arch Linux\n\n10. OpenSUSE"], "9": ["The Conclusion", "So, this was about the history of Linux. As of the present, Linux can run TCP/IP, \nX Window System, Web, Emacs, mail and news software, and much more. Every major software package has been ported \nto Linux. Also, commercial software is coming to the public. Today, many software developers begin their \ndevelopment journey with Linux apps.\nAnd not to forget the hardware support! More and more hardware is being \nsupported by Linux with the passing time than they are by the original Linux kernel. If you are still reading \nthis article, I hope you find this article informative and helpful."]}